app/controllers/admin_users_controller.rb

INSERT INTO "admin_users" ("created_at", "email", "first_name", "last_name", "password_digest", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
     @admin_user = AdminUser.new(admin_user_params)
      if @admin_user.save

SELECT  "admin_users".* FROM "admin_users"  WHERE "admin_users"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @admin_user = AdminUser.find(params[:id])

SELECT  "admin_users".* FROM "admin_users"  WHERE "admin_users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "admin_users" SET "last_name" = ?, "updated_at" = ? WHERE "admin_users"."id" = 1  [["last_name", "Sapkota"], ["updated_at", "2015-02-03 15:49:24.589755"]]
---
  def update
    @admin_user = AdminUser.find(params[:id])
    if @admin_user.update_attributes(admin_user_params)

SELECT  "admin_users".* FROM "admin_users"  WHERE "admin_users"."id" = ? LIMIT 1  [["id", 2]]
---
  def delete
   @admin_user = AdminUser.find(params[:id])

DELETE FROM "admin_users" WHERE "admin_users"."id" = ?  [["id", 2]]
SELECT  "admin_users".* FROM "admin_users"  WHERE "admin_users"."id" = ? LIMIT 1  [["id", 2]]
---
  def destroy
    AdminUser.find(params[:id]).destroy