app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    if @post.save
---
INSERT INTO "posts" ("content", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Awesome ! Looks like a good beginning."], ["created_at", "2014-07-26 18:40:42.117015"], ["title", "yeaa!! my first post."], ["updated_at", "2014-07-26 18:40:42.117015"]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "content" = ?, "title" = ?, "updated_at" = ? WHERE "posts"."id" = 6  [["content", "whatever....."], ["title", "New Post, New Style"], ["updated_at", "2014-08-02 17:21:31.165434"]]